/*
  Previous - rtcnvram.c

  This file is distributed under the GNU General Public License, version 2
  or at your option any later version. Read the file gpl.txt for details.

  This file contains a simulation of the MC68HC68T1 and MCCS1850 Real Time
  Clock chips and NVRAM configuration.
*/
const char Rtcnvram_fileid[] = "Previous rtcnvram.c";

#include "main.h"
#include "host.h"
#include "ioMem.h"
#include "ioMemTables.h"
#include "log.h"
#include "configuration.h"
#include "dimension.hpp"
#include "sysReg.h"
#include "rtcnvram.h"

#include <time.h>

#define LOG_RTC_LEVEL   LOG_DEBUG


/* ---------------- RTC serial interface ---------------- */
#define RTC_ADDR_WRITE  0x80
#define RTC_ADDR_CLOCK  0x20
#define RTC_ADDR_MASK   0x7F
static uint8_t rtc_addr = 0;
static uint8_t rtc_val  = 0;
static uint8_t rtc_data = 0;
static int     phase    = 0;


/* --------------------- MC68HC68T1 --------------------- *
 *
 * RTC NVRAM is located at address 0x00 to 0x1F (32 bytes),
 * time registers, alarm registers and control/status
 * registers are located at address 0x20 to 0x32.
 */

static char rtc_treg_name[8][8] = {
    "second ",
    "minute ",
    "hour   ",
    "wday   ",
    "day    ",
    "month  ",
    "year   ",
    "unknown"
};

typedef struct {
    uint8_t sec;      /* 00 - 59 */
    uint8_t min;      /* 00 - 59 */
    uint8_t hour;     /* 01 - 12 or 00 - 24; bit 7: 1 = 12 hr, 0 = 24 hr; bit 5: 1 = pm, 0 = am */
    uint8_t wday;     /* 01 - 07; 1 = sunday */
    uint8_t mday;     /* 01 - 31 */
    uint8_t month;    /* 01 - 12; 1 = january */
    uint8_t year;     /* 00 - 99 */
} RTC_TIME;

typedef struct {
    uint8_t sec;      /* 00 - 59 */
    uint8_t min;      /* 00 - 59 */
    uint8_t hour;     /* 01 - 12 or 00 - 24; bit 5: 1 = pm, 0 = am in 24 hr mode */
} RTC_ALARM;

struct {
    uint8_t ram[32];    /* 0x00 - 0x1F (r), 0x80 - 0x9F (w) */
    RTC_TIME time;      /* 0x20 - 0x26 (r), 0xA0 - 0xA6 (w) */
    RTC_ALARM alarm;    /* 0xA8 - 0xAA (w) */
    uint8_t status;     /* 0x30 (r) */
    uint8_t clkctrl;    /* 0x31 (r), 0xB1 (w) */
    uint8_t intctrl;    /* 0x32 (r), 0xB2 (w) */
} rtc;

/* All time values in RTC clock are in packed decimal format.
 * Year is supported up to 2050 through overflow of decimal decade.
 */
static uint8_t toBCD(int val) {
    return (((val / 10) % 10) << 4) | (val % 10);
}

static uint8_t toBCDyr(int val) {
    return (((val / 10) & 0xF) << 4) | (val % 10);
}

static uint8_t toBCDhr(int val) {
    if (rtc.time.hour & 0x80) {
        if ((val % 12) == 0) val += 12;
        if (val > 12) {
            return toBCD(val-12) | 0xA0;
        } else {
            return toBCD(val) | 0x80;
        }
    } else {
        return toBCD(val);
    }
}

static int fromBCD(uint8_t bcd) {
    return ((bcd & 0xF0) >> 4) * 10 + (bcd & 0xF);
}

static int fromBCDhr(uint8_t bcd) {
    if (bcd & 0x80) {
        if ((bcd & 0x1F) == 0x12) bcd &= 0xA0;
        if (bcd & 0x20) {
            return fromBCD(bcd & 0x1F) + 12;
        } else {
            return fromBCD(bcd & 0x1F);
        }
    } else {
        return fromBCD(bcd);
    }
}

static void oldrtc_get_time(void) {
    struct tm* t = host_unix_tm();
    
    rtc.time.sec   = toBCD(t->tm_sec);
    rtc.time.min   = toBCD(t->tm_min);
    rtc.time.hour  = toBCDhr(t->tm_hour);
    rtc.time.wday  = toBCD(t->tm_wday + 1);
    rtc.time.mday  = toBCD(t->tm_mday);
    rtc.time.month = toBCD(t->tm_mon + 1);
    rtc.time.year  = toBCDyr(t->tm_year);
}

static void oldrtc_set_time(void) {
    static struct tm t;
    
    t.tm_sec  = fromBCD(rtc.time.sec);
    t.tm_min  = fromBCD(rtc.time.min);
    t.tm_hour = fromBCDhr(rtc.time.hour);
    t.tm_wday = fromBCD(rtc.time.wday) - 1;
    t.tm_mday = fromBCD(rtc.time.mday);
    t.tm_mon  = fromBCD(rtc.time.month) - 1;
    t.tm_year = fromBCD(rtc.time.year);
    
    host_set_unix_tm(&t);
}

static void oldrtc_check_time(void) {
    uint8_t year;
    
    oldrtc_get_time();
    year = fromBCD(rtc.time.year);
    if (year >= NEXT_LIMIT_YEAR || year < NEXT_MIN_YEAR) {
        Log_Printf(LOG_WARN,"[RTC] Year %d beyond valid range. Setting year to %d.", 1900+year, 1900+NEXT_START_YEAR);
        rtc.time.year = toBCDyr(NEXT_START_YEAR);
        oldrtc_set_time();
    }
}


/* There are 3 status and control registers inside the chip */

/* RTC Status Register at 0x30 (r only)
 *
 * 0-0- ----    always 0 (0 in bit 7 identifies MC68HC68T1 chip)
 * -x-- ----    watchdog detected cpu failure
 * ---x ----    first time up
 * ---- x---    interrupt true (one of following interrupts is valid)
 * ---- -x--    power sense interrupt
 * ---- --x-    alarm interrupt
 * ---- ---x    clock interrupt
 */

#define RTC_CPUFAIL     0x40
#define RTC_FIRSTUP     0x10
#define RTC_INT         0x08
#define RTC_INT_SENSE   0x04
#define RTC_INT_ALARM   0x02
#define RTC_INT_CLOCK   0x01


/* RTC Clock Control Register at 0x31 (r) or 0xB1 (w)
 *
 * x--- ----    1 = start, 0 = stop counter
 * -x-- ----    1 = enable line input, 0 = enable chrystal input
 * --xx ----    chrystal select: 0 = 4.194304 MHz, 1 = 2.097152, 2 = 1.048576, 3 = 32.768 kHz
 * ---- x---    1 = line input 50 Hz, 0 = line input 60 Hz
 * ---- -xxx    clock out frequency:
 *
 * 0 = chrystal
 * 1 = chrystal/2
 * 2 = chrystal/4
 * 3 = chrystal/8
 * 4 = disable
 * 5 = 1 Hz
 * 6 = 2 Hz
 * 7 = 50/60 Hz for line operation; 64 Hz for chrystal operation
 */

#define RTC_START   0x80
#define RTC_STOP    0x00
#define RTC_LINE    0x40
#define RTC_XTAL    0x30
#define RTC_L50HZ   0x08
#define RTC_FREQ    0x07


/* RTC Interrupt Control Register at 0x32 (r) or 0xB2 (w)
 *
 * x--- ----    watchdog enable
 * -x-- ----    initiate power down
 * --x- ----    power sense
 * ---x ----    enable alarm
 * ---- xxxx    select frequency of periodic interrupt:
 *
 * 0 = diable
 * chrystal:
 * 1 = 2048 Hz, 2 = 1024 Hz, ... , C = 1 Hz
 * D = 1 per min, E = 1 per hour, F = 1 per day
 * line:
 * 6 = 50 or 60 Hz, B = 2 Hz, C = 1 Hz
 * D = 1 per min, E = 1 per hour, F = 1 per day
 */

#define RTC_WATCHDOG    0x80
#define RTC_POWERDOWN   0x40
#define RTC_PWRSENSE    0x20
#define RTC_ENABLEALRM  0x10
#define RTC_PERIODIC    0x0F


/* Read and write RTC registers */
static uint8_t oldrtc_get_clock(uint8_t addr) {
    uint8_t val = 0x00;
        
    switch (rtc_addr&RTC_ADDR_MASK) {
        case 0x20: /* seconds */
            val = rtc.time.sec; break;
        case 0x21: /* minutes */
            val = rtc.time.min; break;
        case 0x22: /* hours */
            val = rtc.time.hour; break;
        case 0x23: /* day of week (sunday = 1) */
            val = rtc.time.wday; break;
        case 0x24: /* day of month */
            val = rtc.time.mday; break;
        case 0x25: /* month */
            val = rtc.time.month; break;
        case 0x26: /* year (0 - 99) */
            val = rtc.time.year; break;            
        case 0x30: /* status register */
            val = rtc.status & 0x5F;
            rtc.status &= RTC_INT_SENSE;
            break;
        case 0x31: /* clock control register */
            val = rtc.clkctrl; break;
        case 0x32: /* interrupt control register */
            val = rtc.intctrl; break;
            
        default: break;
    }
    
    return val;
}

static void oldrtc_put_clock(uint8_t addr, uint8_t val) {
    uint8_t changed = val;
    
    switch (addr&RTC_ADDR_MASK) {
        case 0x20: /* seconds */
            rtc.time.sec = val;
            if (rtc.clkctrl&RTC_START) {
                oldrtc_set_time();
            }
            break;
        case 0x21: /* minutes */
            rtc.time.min = val;
            if (rtc.clkctrl&RTC_START) {
                oldrtc_set_time();
            }
            break;
        case 0x22: /* hours */
            rtc.time.hour = val&0xBF;
            if (rtc.clkctrl&RTC_START) {
                oldrtc_set_time();
            }
            break;
        case 0x23: /* day of week (sunday = 1) */
            rtc.time.wday = val&0x07;
            if (rtc.clkctrl&RTC_START) {
                oldrtc_set_time();
            }
            break;
        case 0x24: /* day of month */
            rtc.time.mday = val;
            if (rtc.clkctrl&RTC_START) {
                oldrtc_set_time();
            }
            break;
        case 0x25: /* month */
            rtc.time.month = val;
            if (rtc.clkctrl&RTC_START) {
                oldrtc_set_time();
            }
            break;
        case 0x26: /* year (0 - 99) */
            rtc.time.year = val;
            if (rtc.clkctrl&RTC_START) {
                oldrtc_set_time();
            }
            break;
            
        case 0x28: /* alarm: seconds */
            rtc.alarm.sec = val;
            break;
        case 0x29: /* alarm: minutes */
            rtc.alarm.min = val;
            break;
        case 0x2A: /* alarm: hours */
            rtc.alarm.hour = val&0x3F;
            break;
            
        case 0x31: /* clock control register */
            changed ^= rtc.clkctrl;
            rtc.clkctrl = val;
            if (changed&RTC_START) {
                if (rtc.clkctrl&RTC_START) {
                    Log_Printf(LOG_WARN, "[RTC] Start clock");
                    oldrtc_set_time();
                } else {
                    Log_Printf(LOG_WARN, "[RTC] Stop clock");
                }
            }
            if (changed&RTC_LINE) {
                Log_Printf(LOG_RTC_LEVEL, "[RTC] %s input", (rtc.intctrl&RTC_LINE) ? "Line" : "Chrystal");
            }
            break;
        case 0x32: /* interrupt control register */
            changed ^= rtc.intctrl;
            rtc.intctrl = val;
            if (rtc.intctrl&RTC_POWERDOWN) {
                Log_Printf(LOG_WARN, "[RTC] Power down!");
                Main_RequestQuit(false);
                return;
            }
            if (changed&RTC_WATCHDOG) {
                Log_Printf(LOG_WARN, "[RTC] %s watchdog (unimplemented)", (rtc.intctrl&RTC_WATCHDOG) ? "Enable" : "Disable");
            }
            if (changed&RTC_PWRSENSE) {
                Log_Printf(LOG_WARN, "[RTC] %s power sense (unimplemented)", (rtc.intctrl&RTC_PWRSENSE) ? "Enable" : "Disable");
            }
            if (changed&RTC_ENABLEALRM) {
                Log_Printf(LOG_WARN, "[RTC] %s alarm", (rtc.intctrl&RTC_ENABLEALRM) ? "Enable" : "Disable");
            }
            break;
            
        default: break;
    }
    if ((addr&RTC_ADDR_MASK) <= 0x26) {
        Log_Printf(LOG_WARN,"[RTC] setting %s to %02x",rtc_treg_name[addr&7],val);
    }
}

/* RTC alarm */
static void oldrtc_check_alarm(void) {
    if (rtc.intctrl&RTC_ENABLEALRM) {
        if (rtc.clkctrl&RTC_START) {
            oldrtc_get_time();
        }
        if ((rtc.time.hour&0x3F) == (rtc.alarm.hour&0x3F) &&
            rtc.time.sec == rtc.alarm.sec &&
            rtc.time.min == rtc.alarm.min) {
            rtc.status |= (RTC_INT_ALARM | RTC_INT);
        }
    }
}

/* Interrupt pin of RTC is not connected. Interrupts are generated from the keyboard. */
static void oldrtc_request_power_down(void) {
    set_interrupt(INT_POWER, SET_INT);
}

static void oldrtc_stop_pdown_request(void) {
    set_interrupt(INT_POWER, RELEASE_INT);
}


static int oldrtc_interface_io(uint8_t rtdatabit) {
    
    phase++;
    
    if (phase<=8) {
        rtc_addr = (rtc_addr<<1)|(rtdatabit?1:0);
    } else {
        
        if (phase==9) {
            if (!(rtc_addr&RTC_ADDR_WRITE)) {
                if (rtc_addr&RTC_ADDR_CLOCK) {
                    rtc_val = oldrtc_get_clock(rtc_addr);
                } else {
                    rtc_val = rtc.ram[rtc_addr&RTC_ADDR_MASK];
                }
                
                Log_Printf(LOG_RTC_LEVEL,"[RTC] reading val $%02X from addr $%02X",rtc_val,rtc_addr);
            }
        }
        
        if (rtc_addr&RTC_ADDR_WRITE) {
            rtc_val = (rtc_val<<1)|(rtdatabit?1:0);
        } else {
            rtdatabit = (rtc_val&(1<<(16-phase)))?1:0;
        }
        
        if (phase==16) {
            if (rtc_addr&RTC_ADDR_WRITE) {
                Log_Printf(LOG_RTC_LEVEL,"[RTC] writing val $%02X to addr $%02X",rtc_val,rtc_addr);
                
                if (rtc_addr&RTC_ADDR_CLOCK) {
                    oldrtc_put_clock(rtc_addr, rtc_val);
                } else {
                    rtc.ram[rtc_addr&RTC_ADDR_MASK] = rtc_val;
                }
            }
            
            switch (rtc_addr) {
                case 0x1F:
                case 0x9F: rtc_addr = 0x00; break;
                case 0x32:
                case 0xB2: rtc_addr = 0x20; break;
                default: rtc_addr++; break;
            }
            phase-=8;
        }
    }
    
    /* RTC returns 0 or 1 */
    return rtdatabit;
}

/* Time counter is freezed while serial interface is active */
static void oldrtc_interface_start(void) {
    if (rtc.clkctrl&RTC_START) {
        oldrtc_get_time();
    }
}


/* ------------------------- MCCS1850 ------------------------- */

/* RTC NVRAM (64 bytes) is located at address 0x00 to 0x1F
 * and 0x40 to 0x5F, time registers, alarm registers and 
 * control/status registers are located at address 0x20 to 0x31.
 */


/* New RTC has two 32 bit counters, one for time and one for alarm */

/* There are 3 status and control registers inside the chip */

/* RTC Status Register at 0x30 (r only)
 *
 * 1--- ----    always 1 (identifies MCCS1850 chip)
 * -0-- ----    always 0
 * --x- ----    test mode status
 * ---x ----    first time up
 * ---- x---    interrupt true (one of following interrupts is valid)
 * ---- -x--    low battery interrupt
 * ---- --x-    alarm interrupt
 * ---- ---x    power down interrupt
 */

#define NRTC_NEWCHIP    0x80
#define NRTC_TMODE      0x20
#define NRTC_FIRSTUP    0x10
#define NRTC_INT        0x08
#define NRTC_INT_LBAT   0x04
#define NRTC_INT_ALARM  0x02
#define NRTC_INT_PDOWN  0x01


/* RTC Control Register at 0x31 (r) or 0xB1 (w)
 *
 * x--- ----    1 = start, 0 = stop counter
 * -x-- ----    initiate power down
 * --x- ----    enable auto restart sequence
 * ---x ----    enable alarm
 * ---- x---    alarm clear (clear alarm int bit in status)
 * ---- -x--    first time up clear (clear first up bit in status)
 * ---- --x-    enable low battery interrupting
 * ---- ---x    request power down clear (clear power down int bit in status)
 *
 * ---- xx-x    always read as 0
 */

#define NRTC_CTRL_0     0x4D

#define NRTC_START      0x80
#define NRTC_STOP       0x00
#define NRTC_POWERDOWN  0x40
#define NRTC_AR         0x20
#define NRTC_ENABLEALRM 0x10
#define NRTC_CLRALARM   0x08
#define NRTC_CLRFTU     0x04
#define NRTC_LBE        0x02
#define NRTC_CLRPDOWN   0x01


struct {
    /* --> see old chip  * 0x00 - 0x1F (r), 0x80 - 0x9F (w) */
    uint32_t timecntr;    /* 0x20 - 0x23 (r), 0xA0 - 0xA3 (w) */
    uint32_t alarmcntr;   /* 0x24 - 0x27 (r), 0xA4 - 0xA7 (w) */
    uint8_t status;       /* 0x30 (r) */
    uint8_t control;      /* 0x31 (r), 0xB1 (w) */
    uint8_t ram2[32];     /* 0x40 - 0x5F (r), 0xC0 - 0xDF (w) */
} newrtc;

#define RTC_ADDR_NEWRAM 0x40

/* RTC interrupts */
static void newrtc_check_interrupt(void) {
    if (((newrtc.status&NRTC_INT_ALARM) && (newrtc.control&NRTC_ENABLEALRM)) ||
        ((newrtc.status&NRTC_INT_LBAT)  && (newrtc.control&NRTC_LBE))        ||
        ((newrtc.status&NRTC_FIRSTUP)   || (newrtc.status&NRTC_INT_PDOWN))) {
        newrtc.status |= NRTC_INT;
        set_interrupt(INT_POWER, SET_INT);
    } else {
        newrtc.status &= ~NRTC_INT;
        set_interrupt(INT_POWER, RELEASE_INT);
    }
}

/* Read and write RTC */
static uint8_t newrtc_get_clock(uint8_t addr) {
    uint8_t val = 0x00;
        
    switch (rtc_addr&RTC_ADDR_MASK) {
        case 0x20:
            val = (newrtc.timecntr>>24);
            break;
        case 0x21:
            val = (newrtc.timecntr>>16);
            break;
        case 0x22:
            val = (newrtc.timecntr>>8);
            break;
        case 0x23:
